//: 比较字符串: Swift提供3种方法比较文本值: 字符串和字符相等性,前缀相等,后缀相等

//: - 字符串和字符相等性:用 == 或 != 操作符. Unicode扩展语素组合而成的字符与正式的单个字符被视为相等.
"\u{1112}\u{1161}\u{11ab}" == "\u{d55c}"

//: - 但不同语义的Unicode字符是不相等的. 比如英语的A和俄文的A虽然相似,但语义不同,不能视为相等. 中文的"对"和日文的"対"虽然语义相同,字型明显不同.



//: - 前缀和后缀相等: 用于检查一个字符串是否具有特定前缀和后缀. hasPrefix和hasSuffix
var a = ["我有一个梦想","我有一把吉他","我虽然没钱,但一样有梦想"]

var 我开头 = 0
var 梦想结尾 = 0

for 词 in a {
    if 词.hasPrefix("我") {
        我开头++
    }
    
    if 词.hasSuffix("梦想") {
        梦想结尾++
    }
}


//: [字符串的不同Unicode编码](@next)
