//: ----
//:  - [小波说Swift 2](http://www.xiaoboswift.com)
//:  - 全集课件：[github.com/yagamis](http://github.com/yagamis/swift2basic)
//: ----
//: 基础操作符
//:
//: ----
//:
//:  - 一个操作符是一个特殊的符号或者短语,可以检查/变更/组合值.(类似数学中的运算符)
//:  - 简单的: 加法 + , 可以让两个数字相加.
let a = 3 + 5
//:  - 复杂的: 逻辑与 &&, 自增操作符

//:  - 支持C语言风格的各式操作符,增强性能同时消除了一些经典错误,比如赋值操作 = 不再返还值

//:  - 数学操作符 +,-,*,/,%等可以检测溢出,从而避免超过允许范围的运算.Swift有单独的溢出操作符.

//:  - Swift可以对浮点数求余数 (%). 同时提供区间操作符.
15 % 3.5
14 / 3.5

-1...1
0..<100
//:  - 本章主要探讨如何自定义操作符和让标准操作符适用你的自定义类型
//:
//: ----
//:
//:  [术语>](@next)
