//: 逻辑操作符 :用于修改或组合布尔值. 比如 非诚勿扰 非高帅富勿扰 有富可以扰
//: - 非 ! : 对布尔值取反
let 有颜值 : Bool

有颜值 = true

if !有颜值 {
    print("这里不欢迎丑男")
} else {
    print("欢迎帅哥")
}
//: - 与 &&  : 布尔值组合,只有全部为true, 结果才为true
let (高,上,大) = (true, true, false)

if 高 && 上 && 大 {
    print("我们博物馆欢迎高上大的展品")
} else {
    print("太土了,不适合进我们博物馆.")
}


//: - 或 || : 布尔值组合,只要其中一项为true, 结果就为true
let (房, 车, 工作) = (false, false, true)

if 房 || 车 || 工作 {
    print("可以贷款!")
} else {
    print("对不起,不满足条件")
}


//: - 组合demo:
// 博物馆招人, 这个人最好有高上大的展品带来

if  (房 || 车 || 工作) && (高 && 上 && 大) {
    print("非常欢迎,您符合我们博物馆的招人条件")
} else {
    print("对不起,您不能满足我们的要求")
}


//: - 用括号来明示操作优先级,让代码更易读

//: [](@next)
