//: 可选绑定: 将可选判断和可选强拆,"安全地"组合在一起.
//: - 🈯️如果可选变量有值,则将值保存于一个临时变量.可用if和while语句进行检查.
//: - 常用固定格式是if let 临时常量 = 某可选变量 { 语句 }
//: - 🌰字符串123的整型转换的有值绑定
let 身份证号1 = "2102199502132560"
if let 纯数字身份证号 = Int(身份证号1) {
    print(纯数字身份证号)
} else {
    print("不是数字身份证号码!")
}


//: 多重绑定 : 一次可以对多个可选变量进行绑定.只需在绑定语句上用逗号分隔.
var 起飞时间:String?
//如果身份证号码是纯数字,且起飞时间已经确定,那么允许登机
if let 纯数字身份证号 = Int(身份证号1), 起飞时间 = 起飞时间 {
    print("\(纯数字身份证号) ,请在 \(起飞时间)前5分钟登机!")
} else {
    print("对不起,因为起飞时间暂未确定,您暂时无法登机!")
}

//: 绑定判断:加上where语句可以对绑定的结果进行判断.
var 法定结婚年龄 :Int?
var 实际结婚年龄 :Int?

法定结婚年龄 = 22
实际结婚年龄 = 28

if let a = 法定结婚年龄, b = 实际结婚年龄 where a < b {
    print("合法结婚")
} else {
    print("非法结婚")
}


//: [暗拆可选类型](@next)
